Tekla Open API Reference for Tekla Structures 2025
DrawingHandler.CloseActiveDrawing Method (Boolean)
 Closes the drawing editor.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool CloseActiveDrawing(
	bool save
)
Public Function CloseActiveDrawing (
	save As Boolean
) As Boolean
Parameters
save
Type: System.Boolean
Whether the active drawing should be saved on close.
Return Value
Type: Boolean
True on success.
See Also
Reference
DrawingHandler Class
CloseActiveDrawing Overload
Tekla.Structures.Drawing Namespace